; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?x ?y)
		(car ?c)
		(location ?l)
		(at-ferry ?l)
		(at ?c ?l)
		(empty-ferry)
		(on ?c))

   (:action sail
       :parameters  (?from ?to)
       :precondition (and (not-eq ?from ?to) 
                          (location ?from) (location ?to) (at-ferry ?from))
       :effect (and  (at-ferry ?to)
		     (not (at-ferry ?from))))


   (:action board
       :parameters (?car ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car  ?loc)
       :precondition  (and  (car ?car) (location ?loc)
			    (on ?car) (at-ferry ?loc))
       :effect (and (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
(define (problem ferry-l3-c2)
(:domain ferry)
(:objects l0 l1 l2 
          c0 c1 
)
(:init
(location l0)
(location l1)
(location l2)
(car c0)
(car c1)
(not-eq l0 l1)
(not-eq l1 l0)
(not-eq l0 l2)
(not-eq l2 l0)
(not-eq l1 l2)
(not-eq l2 l1)
(empty-ferry)
(at c0 l0)
(at c1 l2)
(at-ferry l0)
)
(:goal
(and
(at c0 l2)
(at c1 l0)
)
)

(:constraints
  (and
    (sometime-before (at c1 l0) (at c0 l2))
    (always (not (at c0 l1)))
    (always (not (at c1 l1)))
  )
)
)

; plan
1. (board c0 l0)
   deleted: (at c0 l0) (empty-ferry)
   added: (on c0)
   goals met: 0 of 2
2. (sail l0 l2)
   deleted: (at-ferry l0)
   added: (at-ferry l2)
   goals met: 0 of 2
3. (debark c0 l2)
   deleted: (on c0)
   added: (at c0 l2) (empty-ferry)
   goals met: 1 of 2
4. (board c1 l2)
   deleted: (at c1 l2) (empty-ferry)
   added: (on c1)
   goals met: 1 of 2
5. (sail l2 l0)
   deleted: (at-ferry l2)
   added: (at-ferry l0)
   goals met: 1 of 2
6. (debark c1 l0)
   deleted: (on c1)
   added: (at c1 l0) (empty-ferry)
   goals met: 2 of 2
